let i = 0;
while (i < 50) {
  console.log("현재 i의 값은?" + i);
  i += 2;
}
/*
 현재 i의 값은?0
 현재 i의 값은?2
 현재 i의 값은?4
 현재 i의 값은?6
 현재 i의 값은?8
 현재 i의 값은?10
 현재 i의 값은?12
 현재 i의 값은?14
 현재 i의 값은?16
 현재 i의 값은?18
 현재 i의 값은?20
 현재 i의 값은?22
 현재 i의 값은?24
 현재 i의 값은?26
 현재 i의 값은?28
 현재 i의 값은?30
 현재 i의 값은?32
 현재 i의 값은?34
 현재 i의 값은?36
 현재 i의 값은?38
 현재 i의 값은?40
 현재 i의 값은?42
 현재 i의 값은?44
 현재 i의 값은?46
 현재 i의 값은?48
*/

var sum = 0;
for (var j = 0; j < 50; j += 2) {
  sum += j;
  console.log("현재 까지의 더한 결과는?" + sum);
}
/*
 현재 까지의 더한 결과는?0
 현재 까지의 더한 결과는?2
 현재 까지의 더한 결과는?6
 현재 까지의 더한 결과는?12
 현재 까지의 더한 결과는?20
 현재 까지의 더한 결과는?30
 현재 까지의 더한 결과는?42
 현재 까지의 더한 결과는?56
 현재 까지의 더한 결과는?72
 현재 까지의 더한 결과는?90
 현재 까지의 더한 결과는?110
 현재 까지의 더한 결과는?132
 현재 까지의 더한 결과는?156
 현재 까지의 더한 결과는?182
 현재 까지의 더한 결과는?210
 현재 까지의 더한 결과는?240
 현재 까지의 더한 결과는?272
 현재 까지의 더한 결과는?306
 현재 까지의 더한 결과는?342
 현재 까지의 더한 결과는?380
 현재 까지의 더한 결과는?420
 현재 까지의 더한 결과는?462
 현재 까지의 더한 결과는?506
 현재 까지의 더한 결과는?552
 현재 까지의 더한 결과는?600
*/
